evaluation_tests/test2_webserver/tc2_html_curve/step04_rps1200__.txt
Running 30s test @ http://54.235.233.71/
  4 threads and 256 connections
  Thread calibration: mean lat.: 116.067ms, rate sampling interval: 247ms
  Thread calibration: mean lat.: 115.791ms, rate sampling interval: 247ms
  Thread calibration: mean lat.: 115.720ms, rate sampling interval: 246ms
  Thread calibration: mean lat.: 124.786ms, rate sampling interval: 289ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   115.11ms    9.11ms 437.25ms   85.09%
    Req/Sec   300.03     48.46   444.00     79.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  112.77ms
 75.000%  117.89ms
 90.000%  125.95ms
 99.000%  150.53ms
 99.900%  168.19ms
 99.990%  235.13ms
 99.999%  437.50ms
100.000%  437.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     104.511     0.000000            2         1.00
     107.135     0.100000         2430         1.11
     108.607     0.200000         4823         1.25
     110.271     0.300000         7163         1.43
     111.487     0.400000         9441         1.67
     112.767     0.500000        11810         2.00
     113.535     0.550000        13014         2.22
     114.431     0.600000        14239         2.50
     115.391     0.650000        15408         2.86
     116.479     0.700000        16520         3.33
     117.887     0.750000        17733         4.00
     118.719     0.775000        18289         4.44
     119.679     0.800000        18878         5.00
     120.767     0.825000        19490         5.71
     122.047     0.850000        20064         6.67
     123.839     0.875000        20651         8.00
     124.927     0.887500        20960         8.89
     125.951     0.900000        21240        10.00
     127.103     0.912500        21545        11.43
     128.255     0.925000        21831        13.33
     129.791     0.937500        22130        16.00
     130.559     0.943750        22273        17.78
     131.967     0.950000        22430        20.00
     133.375     0.956250        22567        22.86
     134.399     0.962500        22719        26.67
     135.295     0.968750        22860        32.00
     136.063     0.971875        22935        35.56
     137.727     0.975000        23009        40.00
     139.903     0.978125        23088        45.71
     142.079     0.981250        23156        53.33
     144.895     0.984375        23231        64.00
     145.791     0.985938        23270        71.11
     146.559     0.987500        23304        80.00
     148.223     0.989062        23340        91.43
     151.295     0.990625        23376       106.67
     153.727     0.992188        23413       128.00
     155.391     0.992969        23432       142.22
     156.287     0.993750        23450       160.00
     156.927     0.994531        23469       182.86
     159.231     0.995313        23487       213.33
     161.535     0.996094        23510       256.00
     162.303     0.996484        23517       284.44
     163.199     0.996875        23526       320.00
     163.839     0.997266        23533       365.71
     164.991     0.997656        23542       426.67
     166.911     0.998047        23551       512.00
     167.167     0.998242        23557       568.89
     167.423     0.998437        23562       640.00
     167.807     0.998633        23566       731.43
     168.063     0.998828        23571       853.33
     168.319     0.999023        23574      1024.00
     168.575     0.999121        23578      1137.78
     168.703     0.999219        23579      1280.00
     168.959     0.999316        23581      1462.86
     169.855     0.999414        23585      1706.67
     170.239     0.999512        23586      2048.00
     170.879     0.999561        23588      2275.56
     170.879     0.999609        23588      2560.00
     172.799     0.999658        23589      2925.71
     173.951     0.999707        23591      3413.33
     174.335     0.999756        23592      4096.00
     174.335     0.999780        23592      4551.11
     175.359     0.999805        23593      5120.00
     175.359     0.999829        23593      5851.43
     178.687     0.999854        23594      6826.67
     235.135     0.999878        23595      8192.00
     235.135     0.999890        23595      9102.22
     235.135     0.999902        23595     10240.00
     235.135     0.999915        23595     11702.86
     335.615     0.999927        23596     13653.33
     335.615     0.999939        23596     16384.00
     335.615     0.999945        23596     18204.44
     335.615     0.999951        23596     20480.00
     335.615     0.999957        23596     23405.71
     437.503     0.999963        23597     27306.67
     437.503     1.000000        23597          inf
#[Mean    =      115.111, StdDeviation   =        9.112]
#[Max     =      437.248, Total count    =        23597]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35555 requests in 30.12s, 24.89MB read
Requests/sec:   1180.36
Transfer/sec:    846.08KB