evaluation_tests/test2_webserver/tc2_html_curve/step05_rps1600__.txt
Running 30s test @ http://54.235.233.71/
  4 threads and 256 connections
  Thread calibration: mean lat.: 115.059ms, rate sampling interval: 242ms
  Thread calibration: mean lat.: 114.667ms, rate sampling interval: 241ms
  Thread calibration: mean lat.: 114.885ms, rate sampling interval: 241ms
  Thread calibration: mean lat.: 119.639ms, rate sampling interval: 259ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   126.62ms   36.69ms 530.94ms   90.69%
    Req/Sec   399.50     60.92   531.00     73.27%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  114.11ms
 75.000%  124.74ms
 90.000%  158.21ms
 99.000%  275.20ms
 99.900%  466.94ms
 99.990%  506.37ms
 99.999%  531.46ms
100.000%  531.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     104.383     0.000000            1         1.00
     107.455     0.100000         3245         1.11
     108.991     0.200000         6294         1.25
     110.719     0.300000         9500         1.43
     112.319     0.400000        12668         1.67
     114.111     0.500000        15786         2.00
     115.199     0.550000        17325         2.22
     116.543     0.600000        18933         2.50
     118.335     0.650000        20457         2.86
     120.703     0.700000        22054         3.33
     124.735     0.750000        23606         4.00
     127.807     0.775000        24395         4.44
     130.943     0.800000        25177         5.00
     135.423     0.825000        25988         5.71
     141.055     0.850000        26765         6.67
     148.223     0.875000        27539         8.00
     152.959     0.887500        27935         8.89
     158.207     0.900000        28326        10.00
     168.063     0.912500        28719        11.43
     176.767     0.925000        29110        13.33
     186.751     0.937500        29504        16.00
     191.615     0.943750        29703        17.78
     198.783     0.950000        29896        20.00
     206.207     0.956250        30094        22.86
     215.039     0.962500        30289        26.67
     224.383     0.968750        30487        32.00
     230.271     0.971875        30584        35.56
     236.799     0.975000        30684        40.00
     243.199     0.978125        30781        45.71
     250.623     0.981250        30879        53.33
     258.687     0.984375        30978        64.00
     260.991     0.985938        31028        71.11
     263.935     0.987500        31079        80.00
     270.335     0.989062        31125        91.43
     277.247     0.990625        31174       106.67
     286.207     0.992188        31229       128.00
     292.095     0.992969        31249       142.22
     300.543     0.993750        31273       160.00
     312.319     0.994531        31297       182.86
     339.199     0.995313        31323       213.33
     369.151     0.996094        31347       256.00
     376.575     0.996484        31359       284.44
     390.143     0.996875        31371       320.00
     402.943     0.997266        31384       365.71
     414.463     0.997656        31396       426.67
     431.871     0.998047        31408       512.00
     440.319     0.998242        31414       568.89
     448.255     0.998437        31420       640.00
     454.143     0.998633        31426       731.43
     465.919     0.998828        31433       853.33
     466.943     0.999023        31439      1024.00
     467.711     0.999121        31442      1137.78
     482.047     0.999219        31445      1280.00
     488.447     0.999316        31449      1462.86
     489.471     0.999414        31451      1706.67
     492.543     0.999512        31454      2048.00
     495.871     0.999561        31456      2275.56
     497.407     0.999609        31457      2560.00
     497.663     0.999658        31459      2925.71
     497.919     0.999707        31460      3413.33
     505.599     0.999756        31463      4096.00
     505.599     0.999780        31463      4551.11
     505.599     0.999805        31463      5120.00
     505.855     0.999829        31465      5851.43
     505.855     0.999854        31465      6826.67
     506.367     0.999878        31466      8192.00
     506.367     0.999890        31466      9102.22
     506.367     0.999902        31466     10240.00
     506.623     0.999915        31468     11702.86
     506.623     0.999927        31468     13653.33
     506.623     0.999939        31468     16384.00
     506.623     0.999945        31468     18204.44
     506.623     0.999951        31468     20480.00
     506.623     0.999957        31468     23405.71
     506.623     0.999963        31468     27306.67
     531.455     0.999969        31469     32768.00
     531.455     1.000000        31469          inf
#[Mean    =      126.625, StdDeviation   =       36.692]
#[Max     =      530.944, Total count    =        31469]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  47338 requests in 30.00s, 33.14MB read
Requests/sec:   1577.73
Transfer/sec:      1.10MB