evaluation_tests/test2_webserver/tc2_html_curve/step06_rps2000__.txt
Running 30s test @ http://54.235.233.71/
  4 threads and 256 connections
  Thread calibration: mean lat.: 126.977ms, rate sampling interval: 324ms
  Thread calibration: mean lat.: 131.894ms, rate sampling interval: 346ms
  Thread calibration: mean lat.: 150.734ms, rate sampling interval: 474ms
  Thread calibration: mean lat.: 152.961ms, rate sampling interval: 472ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   123.51ms   28.30ms 547.84ms   92.59%
    Req/Sec   499.91     38.25   589.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  115.78ms
 75.000%  125.31ms
 90.000%  141.70ms
 99.000%  239.23ms
 99.900%  423.93ms
 99.990%  498.43ms
 99.999%  548.35ms
100.000%  548.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     104.319     0.000000            2         1.00
     107.775     0.100000         4043         1.11
     110.143     0.200000         7935         1.25
     111.871     0.300000        11898         1.43
     113.599     0.400000        15692         1.67
     115.775     0.500000        19648         2.00
     117.119     0.550000        21601         2.22
     118.719     0.600000        23567         2.50
     120.575     0.650000        25552         2.86
     122.751     0.700000        27498         3.33
     125.311     0.750000        29459         4.00
     126.847     0.775000        30436         4.44
     128.127     0.800000        31400         5.00
     130.111     0.825000        32369         5.71
     133.119     0.850000        33362         6.67
     136.319     0.875000        34323         8.00
     138.623     0.887500        34832         8.89
     141.695     0.900000        35307        10.00
     144.895     0.912500        35802        11.43
     151.295     0.925000        36286        13.33
     159.999     0.937500        36785        16.00
     163.583     0.943750        37027        17.78
     168.575     0.950000        37276        20.00
     172.799     0.956250        37510        22.86
     177.407     0.962500        37760        26.67
     183.423     0.968750        38004        32.00
     186.623     0.971875        38124        35.56
     190.079     0.975000        38250        40.00
     193.919     0.978125        38369        45.71
     200.959     0.981250        38492        53.33
     210.943     0.984375        38615        64.00
     219.007     0.985938        38675        71.11
     220.159     0.987500        38736        80.00
     232.575     0.989062        38799        91.43
     246.783     0.990625        38859       106.67
     260.479     0.992188        38920       128.00
     274.431     0.992969        38951       142.22
     292.351     0.993750        38981       160.00
     312.063     0.994531        39013       182.86
     330.751     0.995313        39043       213.33
     349.951     0.996094        39073       256.00
     364.287     0.996484        39089       284.44
     371.967     0.996875        39106       320.00
     378.623     0.997266        39119       365.71
     386.047     0.997656        39135       426.67
     390.399     0.998047        39150       512.00
     395.007     0.998242        39158       568.89
     402.687     0.998437        39166       640.00
     409.343     0.998633        39173       731.43
     413.951     0.998828        39182       853.33
     424.191     0.999023        39191      1024.00
     424.447     0.999121        39192      1137.78
     428.287     0.999219        39196      1280.00
     431.871     0.999316        39201      1462.86
     435.199     0.999414        39205      1706.67
     436.479     0.999512        39207      2048.00
     440.575     0.999561        39210      2275.56
     440.831     0.999609        39211      2560.00
     446.463     0.999658        39213      2925.71
     447.999     0.999707        39215      3413.33
     458.495     0.999756        39217      4096.00
     470.271     0.999780        39218      4551.11
     474.623     0.999805        39219      5120.00
     488.959     0.999829        39220      5851.43
     489.727     0.999854        39221      6826.67
     498.431     0.999878        39222      8192.00
     498.431     0.999890        39222      9102.22
     502.015     0.999902        39223     10240.00
     502.015     0.999915        39223     11702.86
     511.487     0.999927        39224     13653.33
     511.487     0.999939        39224     16384.00
     511.487     0.999945        39224     18204.44
     534.527     0.999951        39225     20480.00
     534.527     0.999957        39225     23405.71
     534.527     0.999963        39225     27306.67
     534.527     0.999969        39225     32768.00
     534.527     0.999973        39225     36408.89
     548.351     0.999976        39226     40960.00
     548.351     1.000000        39226          inf
#[Mean    =      123.513, StdDeviation   =       28.298]
#[Max     =      547.840, Total count    =        39226]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58556 requests in 30.01s, 40.99MB read
Requests/sec:   1951.49
Transfer/sec:      1.37MB